# The following code creates a dataframe of the purchases from one store over a period of 1 month in 2005 and creates a test set from the same store but a different month of 2005

In [1]:
import numpy as np
import pandas as pd

from mlxtend.frequent_patterns import apriori
from mlxtend.frequent_patterns import association_rules

In [2]:
data=pd.read_csv('sku_store_register_trans.csv')

In [16]:
data.tail(20)

               SKU  STORE  REGISTER  TRANNUM    SALEDATE
111649073  7146946   9909         3    94700  2004-09-30
111649074  8272048   9909         3    95100  2004-10-01
111649075  8272048   9909         3    95100  2004-10-01
111649076  3781677   9909         3    95400  2004-10-01
111649077  4108841   9909        13    95500  2005-06-28
111649078  5893173   9909        13    95500  2005-06-28
111649079  6413173   9909        13    95500  2005-06-28
111649080  7086403   9909         3    96900  2004-10-05
111649081   112307   9909        13    97000  2005-07-04
111649082  2637662   9909        13    97000  2005-07-04
111649083  2637662   9909        13    97000  2005-07-04
111649084  2637662   9909        13    97000  2005-07-04
111649085  2637662   9909        13    97000  2005-07-04
111649086  9589290   9909        13    97300  2005-07-05
111649087  5663975   9909        13    99400  2005-07-07
111649088  5663975   9909        13    99400  2005-07-07
111649089  5663975   9909        13    99400  2005-07-07
111649090  8368304   9909        13    99900  2005-07-07
111649091  8368304   9909        13    99900  2005-07-07
111649092  8368304   9909        13    99900  2005-07-07

In [28]:
onestore=data[data['STORE']==8402]

In [29]:
onestore=onestore.drop(columns=["STORE"])

In [30]:
onestore=onestore[onestore['SALEDATE'].str.contains('2005', na=False)]

In [37]:
onestoretrain=onestore[onestore['SALEDATE'].str.contains('-01-', na=False)]

In [38]:
onestoretest=onestore[onestore['SALEDATE'].str.contains('-02-', na=False)]

In [39]:
onestoretest.head()

              SKU  REGISTER  TRANNUM    SALEDATE
96942476  7999269        10      100  2005-02-07
96942497   136343        70      100  2005-02-23
96942498   136343        70      100  2005-02-23
96942571  3913323       191      100  2005-02-21
96942574  8062893       201      100  2005-02-24

In [40]:
onestoretest=onestoretest.replace('-', '', regex=True).astype(str)

In [41]:
onestoretrain=onestoretrain.replace('-', '', regex=True).astype(str)

In [42]:
onestoretest = onestoretest.assign(UNIQUETRANS = onestoretest.REGISTER.astype(str) + onestoretest.TRANNUM.astype(str)+ onestoretest.SALEDATE.astype(str))
onestoretest.head(20)

              SKU REGISTER TRANNUM  SALEDATE     UNIQUETRANS
96942476  7999269       10     100  20050207   1010020050207
96942497   136343       70     100  20050223   7010020050223
96942498   136343       70     100  20050223   7010020050223
96942571  3913323      191     100  20050221  19110020050221
96942574  8062893      201     100  20050224  20110020050224
96942643  3598013      430     100  20050216  43010020050216
96942644  3718013      430     100  20050216  43010020050216
96942645  3718013      430     100  20050216  43010020050216
96942646  3410289      430     100  20050222  43010020050222
96942647  3757654      430     100  20050222  43010020050222
96942671  4916879      500     100  20050226  50010020050226
96942672  8806926      500     100  20050226  50010020050226
96942673  8996926      500     100  20050226  50010020050226
96942702  6906785      610     100  20050204  61010020050204
96942740  9654040      660     100  20050220  66010020050220
96942779  8703800      780     100  20050214  78010020050214
96942792  8433337      790     100  20050215  79010020050215
96942799  4223596      820     100  20050223  82010020050223
96942800  4813596      820     100  20050223  82010020050223
96942801  9063595      820     100  20050223  82010020050223

In [43]:
onestoretrain = onestoretrain.assign(UNIQUETRANS = onestoretrain.REGISTER.astype(str) + onestoretrain.TRANNUM.astype(str)+ onestoretrain.SALEDATE.astype(str))
onestoretrain.head(20)

              SKU REGISTER TRANNUM  SALEDATE     UNIQUETRANS
96942483  9129941       50     100  20050123   5010020050123
96942522   868897      150     100  20050106  15010020050106
96942690  5400911      560     100  20050105  56010020050105
96942691  6196947      560     100  20050105  56010020050105
96942692  6614464      560     100  20050105  56010020050105
96942693  8696850      560     100  20050105  56010020050105
96942694  9864335      560     100  20050105  56010020050105
96942776  3194708      780     100  20050104  78010020050104
96942777   314088      780     100  20050113  78010020050113
96942778  3254117      780     100  20050113  78010020050113
96942812  1937807      850     100  20050114  85010020050114
96942813  2808367      850     100  20050125  85010020050125
96942814  3248362      850     100  20050125  85010020050125
96942815  5519235      850     100  20050125  85010020050125
96942876  5586314        1     200  20050125    120020050125
96942877  6496314        1     200  20050125    120020050125
96942980  7992671       11     200  20050103   1120020050103
96942981  3806163       11     200  20050105   1120020050105
96942982  3806163       11     200  20050105   1120020050105
96942983  3016216       11     200  20050106   1120020050106

In [44]:
onestoretrain=onestoretrain.drop(columns=["REGISTER", 'TRANNUM','SALEDATE'])

In [45]:
onestoretest=onestoretest.drop(columns=["REGISTER", 'TRANNUM','SALEDATE'])

In [46]:
onestoretrain.head()

              SKU     UNIQUETRANS
96942483  9129941   5010020050123
96942522   868897  15010020050106
96942690  5400911  56010020050105
96942691  6196947  56010020050105
96942692  6614464  56010020050105

In [47]:
onestoretest.head()

              SKU     UNIQUETRANS
96942476  7999269   1010020050207
96942497   136343   7010020050223
96942498   136343   7010020050223
96942571  3913323  19110020050221
96942574  8062893  20110020050224

In [48]:
export_csv = onestoretrain.to_csv ('onestoretrain.csv', index = None, header=True)

In [49]:
export_csv = onestoretest.to_csv ('onestoretraintest.csv', index = None, header=True)

# Code below this line was aimed at subsetting by season, but the dataframes were too large to do association algorithms (the kernel died)

In [12]:
spring=data[data['SALEDATE'].str.contains('-03-|-04-|-05-', na=False)]
summer=data[data['SALEDATE'].str.contains('-06-|-07-|-08-', na=False)]
fall=data[data['SALEDATE'].str.contains('-09-|-10-|-11-', na=False)]
winter=data[data['SALEDATE'].str.contains('-12-|-01-|-02-', na=False)]

In [13]:
spring.head()

        SKU  STORE  REGISTER  TRANNUM    SALEDATE
6    148240    102        10      100  2005-03-18
7   2867564    102        10      100  2005-04-21
8   4097389    102        10      100  2005-04-30
9   1519759    102        10      100  2005-05-03
10  8869876    102        10      100  2005-05-03

In [17]:
winter=winter[winter['SALEDATE'].str.contains('2005', na=False)]

In [14]:
summer.head()

        SKU  STORE  REGISTER  TRANNUM    SALEDATE
17  2307933    102        10      100  2005-06-06
18  2367933    102        10      100  2005-06-06
19  2497650    102        10      100  2005-06-16
20  2574124    102        10      100  2005-06-29
21  9407504    102        10      100  2005-06-30

In [15]:
fall.head()

       SKU  STORE  REGISTER  TRANNUM    SALEDATE
0   440457    102        10      100  2004-09-11
1  6240353    102        10      100  2004-09-22
2  6240353    102        10      100  2004-09-22
3  7977157    102        10      100  2004-10-15
4  4736733    102        10      100  2004-10-25

In [18]:
winter.head()

        SKU  STORE  REGISTER  TRANNUM    SALEDATE
33   136740    102        40      100  2005-01-29
34  1776445    102        40      100  2005-01-29
35  1846445    102        40      100  2005-01-29
36  5856118    102        40      100  2005-01-29
64   206281    102       100      100  2005-02-24

In [4]:
summer=summer.reset_index(drop=True)

In [5]:
spring=spring.reset_index(drop=True)

In [25]:
winter=winter.reset_index(drop=True)

In [7]:
fall=fall.reset_index(drop=True)

In [18]:
spring.shape

(23688926, 5)

In [19]:
summer.shape

(34219301, 5)

In [26]:
winter.shape

(18697303, 5)

In [21]:
fall.shape

(22668255, 5)

In [22]:
spring.isna().sum()

SKU         0
STORE       0
REGISTER    0
TRANNUM     0
SALEDATE    0
dtype: int64

In [23]:
summer.isna().sum()

SKU         0
STORE       0
REGISTER    0
TRANNUM     0
SALEDATE    0
dtype: int64

In [24]:
fall.isna().sum()

SKU         0
STORE       0
REGISTER    0
TRANNUM     0
SALEDATE    0
dtype: int64

In [25]:
winter.isna().sum()

SKU         0
STORE       0
REGISTER    0
TRANNUM     0
SALEDATE    0
dtype: int64

In [8]:
spring = spring.replace('-', '', regex=True).astype(str)

In [9]:
summer = summer.replace('-', '', regex=True).astype(str)

In [10]:
fall = fall.replace('-', '', regex=True).astype(str)

In [50]:
winter=winter.replace('-', '', regex=True).astype(str)

In [ ]:
#data["UNIQUETRANS"] = ""
#data.UNIQUETRANS[0]=0
#j=0
#for i in range(0,len(data.index)):
#    if data.STORE[i]==data.STORE[i-1] and data.REGISTER[i]==data.REGISTER[i-1] and data.TRANNUM[i]==data.TRANNUM[i-1]:
#        data.UNIQUETRANS[i]=j
#    else:
#        data.UNIQUETRANS[i]=j+1
#        j=j+1

In [12]:
spring = spring.assign(UNIQUETRANS = spring.STORE.astype(str) + spring.REGISTER.astype(str) + spring.TRANNUM.astype(str)+ spring.SALEDATE.astype(str))

In [14]:
spring=spring.drop(columns=["STORE","REGISTER", 'TRANNUM','SALEDATE'])
spring.head()

       SKU       UNIQUETRANS
0   148240  1021010020050318
1  2867564  1021010020050421
2  4097389  1021010020050430
3  1519759  1021010020050503
4  8869876  1021010020050503

In [15]:
export_csv = spring.to_csv ('spring.csv', index = None, header=True)

In [16]:
summer = summer.assign(UNIQUETRANS = summer.STORE.astype(str) + summer.REGISTER.astype(str) + summer.TRANNUM.astype(str)+ summer.SALEDATE.astype(str))

In [17]:
summer=summer.drop(columns=["STORE","REGISTER", 'TRANNUM','SALEDATE'])
summer.head()

       SKU       UNIQUETRANS
0  2307933  1021010020050606
1  2367933  1021010020050606
2  2497650  1021010020050616
3  2574124  1021010020050629
4  9407504  1021010020050630

In [18]:
export_csv = summer.to_csv ('summer.csv', index = None, header=True)

In [19]:
fall = fall.assign(UNIQUETRANS = fall.STORE.astype(str) + fall.REGISTER.astype(str) + fall.TRANNUM.astype(str)+ fall.SALEDATE.astype(str))

In [20]:
fall=fall.drop(columns=["STORE","REGISTER", 'TRANNUM','SALEDATE'])
fall.head()

       SKU       UNIQUETRANS
0   440457  1021010020040911
1  6240353  1021010020040922
2  6240353  1021010020040922
3  7977157  1021010020041015
4  4736733  1021010020041025

In [21]:
export_csv = fall.to_csv ('fall.csv', index = None, header=True)

In [22]:
winter = winter.assign(UNIQUETRANS = winter.STORE.astype(str) + winter.REGISTER.astype(str) + winter.TRANNUM.astype(str)+ winter.SALEDATE.astype(str))

In [23]:
winter=winter.drop(columns=["STORE","REGISTER", 'TRANNUM','SALEDATE'])
winter.head()

       SKU       UNIQUETRANS
0  5633754  1021010020041218
1  8084201  1023010020041212
2   136740  1024010020050129
3  1776445  1024010020050129
4  1846445  1024010020050129

In [24]:
export_csv = winter.to_csv ('winter.csv', index = None, header=True)